# Тестовое Задание

In [1]:
import pandas as pd
import sqlite3
current_version = sqlite3.sqlite_version

In [2]:
con = sqlite3.connect('task_1.db')

df_cities = pd.read_sql_query("SELECT * FROM cities", con)
df_orders = pd.read_sql_query("SELECT * FROM orders", con)

In [3]:
df_cities.head(10)

          city_name                               city_id
0            Moscow  b00ce276-6dcb-40ee-9016-4109c8c7b60f
1  Saint-Petersburg  ffd147fa-150a-4789-8252-39a4eaf3ee12
2         Krasnodar  737ea994-2e23-4f39-b220-5b9216b56147
3             Adler  a2b8c09f-0ede-491b-98ae-b6dbba89abb8
4      Ekaterinburg  642e49e5-afa1-40af-97ae-fd108818def9

In [4]:
df_orders.head(10)

,created_at,delivered_at,value_rub,user_id,city_id
0,2020-02-09 22:21:16,2020-02-11 10:55:42,2753,ec3c583d-2098-4c13-8456-72980e9943b7,b00ce276-6dcb-40ee-9016-4109c8c7b60f
1,2020-02-03 04:37:47,2020-02-04 11:30:34,1321,a0bb6ea3-4128-40ed-b0ee-c75f82dcbe6f,b00ce276-6dcb-40ee-9016-4109c8c7b60f
2,2020-02-09 16:18:59,2020-02-11 00:27:52,1164,1f9cf58e-6751-4ad8-854e-e3e50e00b6b6,b00ce276-6dcb-40ee-9016-4109c8c7b60f
3,2020-02-02 22:32:43,2020-02-03 22:01:54,691,90dc4973-50e3-48e1-9655-7cbaa496aac7,b00ce276-6dcb-40ee-9016-4109c8c7b60f
4,2020-02-08 16:52:01,2020-02-09 21:20:34,727,82fcbbde-8a22-46fb-bd2b-376781b3a417,b00ce276-6dcb-40ee-9016-4109c8c7b60f
5,2020-02-06 01:35:40,2020-02-07 05:36:34,1511,52faa6ae-3cdb-48c3-8a10-3e330039d16e,b00ce276-6dcb-40ee-9016-4109c8c7b60f
6,2020-02-01 23:11:21,2020-02-02 23:05:05,3411,4746b9ef-b0e7-45fb-945a-177aba3e06e0,b00ce276-6dcb-40ee-9016-4109c8c7b60f
7,2020-02-06 05:18:23,2020-02-07 09:04:41,1605,e79147ad-8c4f-44f7-8659-399e0942e456,b00ce276-6dcb-40ee-9016-4109c8c7b60f
8,2020-02-03 23:04:46,2020-02-04 22:43:19,2092,20a9848e-c1b8-4e71-af42-7b1bd0627926,b00ce276-6dcb-40ee-9016-4109c8c7b60f
9,2020-02-05 06:13:53,2020-02-06 16:51:50,1314,3f91ad1b-b1cc-4929-8f6f-a9da86176892,b00ce276-6dcb-40ee-9016-4109c8c7b60f

### Q1:
`time_to_delivery` - это метрика, которая считает сколько проходит между созданием (`created_at`) и получением заказа (`delivered_at`)

Посчитайте для каждого города средний `time_to_delivery` и отсорируйте их - от худшего к лучшему

In [5]:
from IPython.core.display import display, HTML
from IPython.core.interactiveshell import InteractiveShell

InteractiveShell.ast_node_interactivity = "all"
display(HTML("<style>.container { width:85% !important; }</style>"))

In [6]:
city_dates = pd.read_sql_query("""SELECT city_name,
                                         ROUND(AVG((JULIANDAY(delivered_at) - JULIANDAY(created_at)) * 24)) AS time_to_delivery
                                    FROM cities
                               LEFT JOIN orders USING(city_id)
                                   GROUP BY city_name
                                   ORDER BY time_to_delivery""", con)
city_dates

          city_name  time_to_delivery
0         Krasnodar               NaN
1            Moscow              30.0
2  Saint-Petersburg              40.0
3      Ekaterinburg              62.0
4             Adler              74.0

#### Овтет дан в часах


### Q2: 
А сколько в среднем проходит между тем как пользователь получил первый заказ, и сделал следующий заказ?

In [7]:
mean_timedelta_delivery = pd.read_sql_query("""SELECT AVG(ROUND((SELECT JULIANDAY(MIN(delivered_at)) * 24
                                                                   FROM orders
                                                                  GROUP BY user_id) - (SELECT JULIANDAY(created_at)
                                                                                         FROM orders
                                                                                        GROUP BY user_id
                                                                                        ORDER BY created_at
                                                                                        LIMIT 1 OFFSET 1) * 24)) AS mean
                                                 FROM orders""", con)

mean_timedelta_delivery

    mean
0  105.0

In [47]:
pd.read_sql_query("""
    WITH q1 AS(
        SELECT MIN(JULIANDAY(delivered_at) * 24) -
               LEAD(JULIANDAY(created_at) * 24)
               OVER(ORDER BY JULIANDAY(created_at) * 24) AS time
          FROM orders
         GROUP BY user_id
    )
    SELECT ROUND(AVG(time)) AS mean FROM q1""", con)

   mean
0  38.0

#### Ответ: В среднем проходит 105 часов

### Q3: 

Посчитайте сколько всего пользователей в Москве имеют средний чек выше 2000 рублей (в % от всех пользователей, у которых был хотя бы один заказ в Москве)

##### Т.к. в базе нет колонки в каком городе проживает человек, а есть только колонка, в которой указано откуда(или куда) был доставлен товар, буду считать, что "пользователи в Москве", это те пользователи, которые хоть раз что-то заказывали в Москве

Если в задании подразумевалось то, что нужно определить живет ли человек в Москве, это будет, как мне кажется, немного некорректно, т.к. Если мы будем считать что человек живет в Москве, если у него все покупки из/в Москву, он мог быть просто проездом в Москве и заказать только 1-ин товар и после этого перестал пользоваться сервисом/маназином.

Если мы будем считать Москвичами тех, людей, которые большую часть своих покупок совершали в Москве, это тоже не совсем корректно, тк у нас много покупателей всего с одним заказом и тогда мы снова возращаемся к первому пункту.

In [8]:
pd.read_sql_query("""WITH 
                       q1 AS (SELECT COUNT(DISTINCT user_id) AS moscow_more_2000
                                FROM orders
                               WHERE user_id IN(SELECT user_id
                                                  FROM cities LEFT JOIN orders USING(city_id)
                                                 WHERE city_name = 'Moscow'
                                                 GROUP BY user_id
                                                HAVING AVG(value_rub) > 2000
                                               )
                             ),
                       q2 AS (SELECT COUNT(DISTINCT user_id) AS moscow
                                FROM cities LEFT JOIN orders USING(city_id)
                               WHERE city_name = 'Moscow'
                             )
                   SELECT ROUND(CAST(moscow_more_2000 AS FLOAT) / CAST(moscow AS FLOAT) * 100) AS procent FROM q1, q2""", con)

   procent
0     39.0

#### Ответ: 39%


### Q4:
Посчитайте сколько часов в среднем проходит между заказами одного и того же пользователя?

In [9]:
df_orders.groupby('user_id') \
         .agg({'created_at': 'count'}) \
         .value_counts()

df_orders.user_id.nunique()

created_at
1             152
2              57
3              39
4              30
dtype: int64

278

#### Ответ с учетом тех пользователей, которые совершили одну и более покупки:

In [49]:
pd.read_sql_query("""SELECT ROUND((MAX(JULIANDAY(created_at)) - MIN(JULIANDAY(created_at))) / (COUNT(created_at) - 1)  * 24) AS hours
                       FROM orders
                      GROUP BY user_id""", con)

     hours
0      NaN
1      NaN
2     77.0
3      NaN
4      NaN
..     ...
273    NaN
274    NaN
275   37.0
276    NaN
277   60.0

[278 rows x 1 columns]

* У тех, кто совершил только одну покупку, среднее = NaN(0)

#### Ответ с пользователями которые совершили более одной покупки:

In [11]:
pd.read_sql_query("""SELECT ROUND((MAX(JULIANDAY(created_at)) - MIN(JULIANDAY(created_at))) / (COUNT(created_at) - 1)  * 24) AS hours
                       FROM orders
                      GROUP BY user_id
                     HAVING COUNT(created_at) > 1""", con)

     hours
0     77.0
1     71.0
2     46.0
3     51.0
4     23.0
..     ...
121   59.0
122   42.0
123   50.0
124   37.0
125   60.0

[126 rows x 1 columns]

#### Среднее кол-во часов между заказами среди всех пользователей у которых кол-во заказов больше одного:

In [12]:
pd.read_sql_query("""WITH q AS (SELECT ROUND((MAX(JULIANDAY(created_at)) - MIN(JULIANDAY(created_at))) / (COUNT(created_at) - 1)  * 24) AS hours
                                  FROM orders
                                 GROUP BY user_id
                                HAVING COUNT(created_at) > 1
                               ) SELECT ROUND(AVG(hours)) AS mean FROM q""", con)

   mean
0  57.0